# ----------------------------- NOTES PART I ----------------------------#

In [1]:
import pandas as pd 
import numpy as np 
np.random.seed(123)

# Create list of values for names column.

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# Randomly generate arrays of scores for each student for each subject.
# Note that all the values need to have the same length here.

math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

# Construct the DataFrame using the above lists and arrays.

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})

In [2]:
# Choose only two columns for my subset.
df[['name', 'classroom']]

# I can pass a boolean Series to the indexing operator as a selector.
bools = df.name.str.startswith('S')
df[bools]

    name  math  english  reading classroom
0  Sally    62       85       80         A
2  Suzie    94       74       95         A

In [3]:
#df.loc[row_indexer, column_indexer]
df.loc[:, 'math':'reading']

#df.iloc[row_indexer, column_indexer]
df.iloc[:3]

    name  math  english  reading classroom
0  Sally    62       85       80         A
1   Jane    88       79       67         B
2  Suzie    94       74       95         A

In [4]:
pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]}) #from dictionary
pd.DataFrame([[1, 2, 3], [4, 5, 6]]) #from 2D array

array = np.array([[1, 2, 3], [4, 5, 6]])
pd.DataFrame(array, columns=['a', 'b', 'c']) #from 2D array with specified names

   a  b  c
0  1  2  3
1  4  5  6

In [5]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [6]:
import numpy as np
import pandas as pd

In [7]:
pd.read_sql('select * from employees limit 5', url)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

# --------------------------- EXERCISES I ----------------------------- #

In [55]:
#Create a function named get_db_url. 
#It should accept a username, hostname, password, and database name 
#and return a url connection string formatted like in the example at the start of this lesson.

import env

def get_db_url(user,host,password):
    url =  f'mysql+pymysql://{user}:{password}@{host}/employees'
    return url

url = get_db_url(user,host,password)

In [56]:
#Use your function to obtain a connection to the employees database.
pd.read_sql('select * from employees limit 2', url)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21

In [57]:
#Intentionally make a typo in the database url. What kind of error message do you see?
pd.read_sql('select * from employees limit 2', 'mysql+pymysql://ursula_2336:G1qhYOM5plWejcpe8ndDfNTqDqlljZiF@data.codeup.com/employee')
# it shows 'access denied'

OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'ursula_2336'@'%%' to database 'employee'")
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [58]:
#Intentionally make an error in your SQL query. What does the error message look like?
pd.read_sql('select from employees limit 2', url)
# it shows 'programming error'

ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'from employees limit 2' at line 1")
[SQL: select from employees limit 2]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [ ]:
# Read the employees and titles tables into two separate DataFrames.
employees = pd.read_sql(
    '''
select *
from employees

''', url)

titles = pd.read_sql(
    '''
select *
from titles

''', url)

In [ ]:
#How many rows and columns do you have in each DataFrame? Is that what you expected?
print(employees.shape)
print(titles.shape)

In [ ]:
#Display the summary statistics for each DataFrame.
print(employees.info)
print(titles.info)

In [ ]:
#How many unique titles are in the titles DataFrame?
len(titles.title.unique())
#or
titles.title.nunique()

In [ ]:
#What is the oldest date in the to_date column? What is the most recent date in the to_date column?
print(titles.to_date.max())
print(titles.to_date.min())

# ---------------------------- NOTES PART II ---------------------------------- #
- df.loc[row_indexer, column_indexer]
- df.iloc[row_indexer, column_indexer]
- df[['english', 'reading', 'math']].agg(['mean', 'min', 'max'])
- df.groupby('classroom').math.agg(['min', 'mean', 'max'])
- df['passing_math'] = np.where(df.math < 70, 'failing', 'passing')
- grade_groups = df.groupby(['passing_math', 'classroom']).reading.agg(['mean', 'count'])
- df.groupby('classroom').reading.describe()

- pd.concat([df1, df2], axis=0) #make it taller
- pd.concat([df1, df2], ignore_index=True)
- pd.concat([concat_df1, concat_df2], axis=1) #make it fatter

- users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)
- (users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='outer')
    .drop(columns='role_id')
    .rename(columns={'id_x': 'id', 
                     'name_x': 'employee',
                     'id_y': 'role_id',
                     'name_y': 'role'}
            )
)

# --------------------------------- EXERCISE II -----------------------------------#

In [12]:
# Copy the users and roles DataFrames from the examples above.
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
print(users)
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
print(roles)

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN
   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [13]:
#What is the result of using a right join on the DataFrames?
right_join = pd.merge(users,roles,how = 'right',left_on = 'role_id',right_on = 'id')
print(right_join)

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [14]:
#What is the result of using an outer join on the DataFrames?
outer_join = pd.merge(users,roles,how = 'outer',left_on = 'role_id',right_on = 'id')
print(outer_join)

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [222]:
#What happens if you drop the foreign keys from the DataFrames and try to merge them?
user_drop = users.drop(columns ='role_id')

drop_merge = pd.merge(user_drop,roles,how = 'outer')
print(drop_merge)

   id       name
0   1        bob
1   2        joe
2   3      sally
3   4       adam
4   5       jane
5   6       mike
6   1      admin
7   2     author
8   3   reviewer
9   4  commenter

In [16]:
#Load the mpg dataset from PyDataset.
import pydataset as p
mpg = p.data('mpg')

In [17]:
#Output and read the documentation for the mpg dataset.
p.data('mpg',show_doc = True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [18]:
#How many rows and columns are in the dataset?
mpg.shape

(234, 11)

In [19]:
#Check out your column names and perform any cleanup you may want on them.
mpg.head()
mpg = mpg.rename(columns = {'cty':'city'})
mpg = mpg.rename(columns = {'manufacturer':'m'})

In [20]:
#Display the summary statistics for the dataset.
mpg.describe()

            displ         year         cyl        city         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [21]:
#How many different manufacturers are there?
mpg.m.nunique()

15

In [22]:
#How many different models are there?
mpg.model.nunique()

38

In [23]:
#Create a column named mileage_difference like you did in the DataFrames exercises; 
#this column should contain the difference between highway and city mileage for each car.

mpg['mileage_difference'] = mpg.hwy - mpg.city
mpg

,m,model,displ,year,cyl,trans,drv,city,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

In [24]:
#Create a column named average_mileage like you did in the DataFrames exercises; 
#this is the mean of the city and highway mileage.

mpg['average_mileage'] = (mpg.city + mpg.hwy)/2
mpg

,m,model,displ,year,cyl,trans,drv,city,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

In [26]:
#Create a new column on the mpg dataset named is_automatic that holds boolean values denoting 
#whether the car has an automatic transmission.
mpg['is_automatic'] = mpg.trans.str.startswith('auto')
mpg

,m,model,displ,year,cyl,trans,drv,city,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

In [235]:
#Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?
mpg[['m','average_mileage']].groupby('m').mean().sort_values(by = 'average_mileage',ascending = False)

            average_mileage
m
honda             28.500000
volkswagen        25.074074
hyundai           22.750000
subaru            22.428571
audi              22.027778
toyota            21.720588
pontiac           21.700000
nissan            21.346154
chevrolet         18.447368
ford              16.680000
mercury           15.625000
jeep              15.562500
dodge             15.540541
lincoln           14.166667
land rover        14.000000

In [51]:
#Do automatic or manual cars have better miles per gallon?

rank = (mpg[['is_automatic','average_mileage']]).sort_values('average_mileage',ascending = False).head(50)
rank[rank.is_automatic == True].count()

# among the top50 highest average MPG cars, 20 of them are automatic, 30 of them is manual. So manual cars perform better.
# or groupby('is_automatic')

is_automatic       20
average_mileage    20
dtype: int64

# ------------------------------ EXERCISE III --------------------------------- #

In [98]:
#Use your get_db_url function to help you explore the data from the chipotle database.

import env

def get_db_url(user,host,password):
    url =  f'mysql+pymysql://{user}:{password}@{host}/chipotle'
    return url

url = get_db_url(user,host,password)

orders = pd.read_sql('select * from orders', url)

orders.item_price = orders.item_price.str.replace('$','') 
# or 
# .str.strip('$')

orders.item_price = orders.item_price.astype(float)
orders.info()

orders.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  4622 non-null   int64
 1   order_id            4622 non-null   int64
 2   quantity            4622 non-null   int64
 3   item_name           4622 non-null   object
 4   choice_description  4622 non-null   object
 5   item_price          4622 non-null   float64
dtypes: float64(1), int64(3), object(2)
memory usage: 216.8+ KB

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39
1,2,1,1,Izze,[Clementine],3.39

In [110]:
# What is the total price for each order?
orders[['order_id','item_price']].groupby('order_id').sum()

          item_price
order_id
1              11.56
2              16.98
3              12.67
4              21.00
5              13.70
...              ...
1830           23.00
1831           12.90
1832           13.20
1833           23.50
1834           28.75

[1834 rows x 1 columns]

In [117]:
# What are the most popular 3 items?

popular = orders[['item_name','quantity']].groupby('item_name').sum()
popular.sort_values(by ='quantity',ascending = False)
# 1. Chicken Bowl	761
# 2. Chicken Burrito	591
# 3. Chips and Guacamole	506

                                       quantity
item_name
Chicken Bowl                                761
Chicken Burrito                             591
Chips and Guacamole                         506
Steak Burrito                               386
Canned Soft Drink                           351
Chips                                       230
Steak Bowl                                  221
Bottled Water                               211
Chips and Fresh Tomato Salsa                130
Canned Soda                                 126
Chicken Salad Bowl                          123
Chicken Soft Tacos                          120
Side of Chips                               110
Veggie Burrito                               97
Barbacoa Burrito                             91
Veggie Bowl                                  87
Carnitas Bowl                                71
Barbacoa Bowl                                66
Carnitas Burrito                             60
Steak Soft Tacos                             56
6 Pack Soft Drink                            55
Chips and Tomatillo Red Chili Salsa          50
Chicken Crispy Tacos                         50
Chips and Tomatillo Green Chili Salsa        45
Carnitas Soft Tacos                          40
Steak Crispy Tacos                           36
Chips and Tomatillo-Green Chili Salsa        33
Steak Salad Bowl                             31
Nantucket Nectar                             29
Chips and Tomatillo-Red Chili Salsa          25
Barbacoa Soft Tacos                          25
Chips and Roasted Chili Corn Salsa           23
Izze                                         20
Veggie Salad Bowl                            18
Chips and Roasted Chili-Corn Salsa           18
Barbacoa Crispy Tacos                        12
Barbacoa Salad Bowl                          10
Chicken Salad                                 9
Carnitas Crispy Tacos                         8
Veggie Soft Tacos                             8
Burrito                                       6
Veggie Salad                                  6
Carnitas Salad Bowl                           6
Bowl                                          4
Steak Salad                                   4
Salad                                         2
Crispy Tacos                                  2
Chips and Mild Fresh Tomato Salsa             1
Carnitas Salad                                1
Veggie Crispy Tacos                           1

In [121]:
# Which item has produced the most revenue?

revenue = orders[['item_name','item_price']].groupby('item_name').sum()
revenue.sort_values(by = 'item_price',ascending = False)

#chicken bowl

                                       item_price
item_name
Chicken Bowl                              7342.73
Chicken Burrito                           5575.82
Steak Burrito                             3851.43
Steak Bowl                                2260.19
Chips and Guacamole                       2201.04
Chicken Salad Bowl                        1228.75
Chicken Soft Tacos                        1108.09
Veggie Burrito                             934.77
Barbacoa Burrito                           894.75
Veggie Bowl                                867.99
Carnitas Bowl                              736.71
Barbacoa Bowl                              672.36
Carnitas Burrito                           597.83
Steak Soft Tacos                           536.05
Chips                                      494.34
Chicken Crispy Tacos                       472.13
Canned Soft Drink                          438.75
Carnitas Soft Tacos                        375.94
Chips and Fresh Tomato Salsa               361.36
Steak Crispy Tacos                         357.34
6 Pack Soft Drink                          356.95
Steak Salad Bowl                           343.59
Bottled Water                              302.56
Barbacoa Soft Tacos                        250.46
Side of Chips                              185.90
Veggie Salad Bowl                          182.50
Chips and Tomatillo Red Chili Salsa        147.50
Canned Soda                                137.34
Chips and Tomatillo Green Chili Salsa      132.75
Barbacoa Crispy Tacos                      120.21
Barbacoa Salad Bowl                        106.40
Nantucket Nectar                            98.31
Chicken Salad                               81.09
Chips and Tomatillo-Green Chili Salsa       78.87
Carnitas Crispy Tacos                       77.96
Veggie Soft Tacos                           73.96
Chips and Roasted Chili Corn Salsa          67.85
Izze                                        67.80
Carnitas Salad Bowl                         66.34
Chips and Tomatillo-Red Chili Salsa         59.75
Veggie Salad                                50.94
Burrito                                     44.40
Chips and Roasted Chili-Corn Salsa          43.02
Steak Salad                                 35.66
Bowl                                        29.60
Salad                                       14.80
Crispy Tacos                                14.80
Carnitas Salad                               8.99
Veggie Crispy Tacos                          8.49
Chips and Mild Fresh Tomato Salsa            3.00

In [211]:
# Join the employees and titles DataFrames together.

def get_db_url(user,host,password):
    url =  f'mysql+pymysql://{user}:{password}@{host}/employees'
    return url

emp_url = get_db_url(user,host,password)

df = pd.read_sql(
    '''
    select * 
from employees
join titles
using (emp_no)
    
    '''
,emp_url)

# or, use the pd.merge function

df.head(2)

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01

In [237]:
# For each title, find the hire date of the employee that was hired most recently with that title.
df.groupby('title').hire_date.max()

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

In [219]:
mask = df.groupby(['title'])['hire_date'].transform(max) == df['hire_date']
df [mask]

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
55137,47291,1960-09-09,Ulf,Flexer,M,2000-01-12,Staff,2000-01-26,9999-01-01
145474,108201,1955-04-14,Mariangiola,Boreale,M,2000-01-01,Senior Engineer,2000-01-01,9999-01-01
148155,110420,1963-07-27,Oscar,Ghazalie,M,1992-02-05,Manager,1996-08-30,9999-01-01
182100,222965,1959-08-07,Volkmar,Perko,F,2000-01-13,Senior Staff,2000-01-29,9999-01-01
212605,243702,1961-10-04,Munehiro,Luke,F,1999-12-24,Assistant Engineer,2000-01-07,9999-01-01
287947,294732,1960-11-07,Karlis,Orsini,M,1999-12-31,Technique Leader,2000-01-28,2001-07-04
389997,463807,1964-06-12,Bikash,Covnot,M,2000-01-28,Engineer,2000-02-01,2000-05-19

In [174]:
df.sort_values('hire_date',ascending = False)

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
389997,463807,1964-06-12,Bikash,Covnot,M,2000-01-28,Engineer,2000-02-01,2000-05-19
337630,428377,1957-05-09,Yucai,Gerlach,M,2000-01-23,Engineer,2000-01-23,9999-01-01
442662,499553,1954-05-06,Hideyuki,Delgrande,F,2000-01-22,Engineer,2000-01-22,9999-01-01
182100,222965,1959-08-07,Volkmar,Perko,F,2000-01-13,Senior Staff,2000-01-29,9999-01-01
55137,47291,1960-09-09,Ulf,Flexer,M,2000-01-12,Staff,2000-01-26,9999-01-01
...,...,...,...,...,...,...,...,...,...
148143,110183,1953-06-24,Shirish,Ossenbruggen,F,1985-01-01,Manager,1985-01-01,1992-03-21
148140,110085,1959-10-28,Ebru,Alpin,M,1985-01-01,Senior Staff,1989-12-17,9999-01-01
148139,110085,1959-10-28,Ebru,Alpin,M,1985-01-01,Manager,1985-01-01,1989-12-17
148135,110022,1956-09-12,Margareta,Markovitch,M,1985-01-01,Manager,1985-01-01,1991-10-01
148136,110022,1956-09-12,Margareta,Markovitch,M,1985-01-01,Senior Staff,1991-10-01,9999-01-01

In [180]:
# Write the code necessary to create a cross tabulation of the number of titles by department. 
# (Hint: this will involve a combination of SQL code to pull the necessary data 
# and python/pandas code to perform the manipulations.)

def get_db_url(user,host,password):
    url =  f'mysql+pymysql://{user}:{password}@{host}/employees'
    return url

emp_url = get_db_url(user,host,password)


tab = pd.read_sql(
    
'''
select *
from titles
join dept_emp
using (emp_no)
join departments
using (dept_no)
'''
    ,emp_url)
tab.head(2)

,dept_no,emp_no,title,from_date,to_date,from_date,to_date,dept_name
0,d009,10011,Staff,1990-01-22,1996-11-09,1990-01-22,1996-11-09,Customer Service
1,d009,10038,Senior Staff,1996-09-20,9999-01-01,1989-09-20,9999-01-01,Customer Service

In [239]:
pd.crosstab(tab.title,tab.dept_name).T

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0